app/views/discussions/_form.html.erb

SELECT "categories".* FROM "categories"   ORDER BY categories.name
SELECT "categories".id FROM "categories" INNER JOIN "categories_discussions" ON "categories"."id" = "categories_discussions"."category_id" WHERE "categories_discussions"."discussion_id" = ?  ORDER BY categories.name  [["discussion_id", 7]]
---
    <%= f.label "Categories" %><br />
    <% Category.all.each do |category| %>
      <%= check_box_tag 'discussion[category_ids][]', category.id,
        @discussion.category_ids.include?(category.id), id: dom_id(category) %>