app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "created_at", "discussion_id", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "TEST"], ["created_at", "2018-12-19 15:07:39.049262"], ["discussion_id", 1], ["email", "thomaswatson04@gmail.com"], ["name", "Thomas Watson"], ["updated_at", "2018-12-19 15:07:39.049262"]]
---
  def create
    @comment = @discussion.comments.new(comment_params)
    if @comment.save

SELECT  "discussions".* FROM "discussions"  WHERE "discussions"."id" = ? LIMIT 1  [["id", 1]]
---
  def load_discussion
    @discussion = Discussion.find(params[:discussion_id])