app/controllers/discussions_controller.rb

  def index

    @discussions = Discussion.all
---
SELECT "discussions".* FROM "discussions"  WHERE (title LIKE '%test%')  ORDER BY created_at DESC

  def edit
    @discussion = current_user.discussions.find(params[:id])
---
SELECT  "discussions".* FROM "discussions"  WHERE "discussions"."user_id" = ? AND "discussions"."id" = ?  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 4], ["id", 7]]

  def create
    @discussion = current_user.discussions.new(discussion_params)

    respond_to do |format|
      if @discussion.save
---
INSERT INTO "discussions" ("body", "created_at", "excerpt", "location", "published_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @discussion = current_user.discussions.find(params[:id])
    @discussion.destroy
---
SELECT  "discussions".* FROM "discussions"  WHERE "discussions"."user_id" = ? AND "discussions"."id" = ?  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 4], ["id", 3]]
DELETE FROM "discussions" WHERE "discussions"."id" = ?  [["id", 3]]

    def set_discussion
      @discussion = Discussion.find(params[:id])
---
SELECT  "discussions".* FROM "discussions"  WHERE "discussions"."id" = ? LIMIT 1  [["id", "all"]]