app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "hashed_password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-12-04 13:52:32.174081"], ["email", "newperson@user.com"], ["hashed_password", "5baa61e4c9b93f3f0682250b6cf8331b7ee68fd8"], ["updated_at", "2015-12-04 13:52:32.174081"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "hashed_password" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["hashed_password", "9bc34549d565d9505b287de0cd20ac77be1d3f2c"], ["updated_at", "2018-12-30 14:10:22.379785"]]
---
  def update
    if @user.update(user_params)